Zeh868/Bmelod/portable/vendor/stm32g4/bm_hal_can_stm32g4.c
/* SPDX-License-Identifier: GPL-3.0-or-later */
/**
 * @file bm_hal_can_stm32g4.c
 * @brief STM32G4 FDCAN1/FDCAN2 后端（寄存器级直接操作，等效 LL 风格）
 *
 * STM32CubeG4 未提供 FDCAN LL 头文件，因此本后端基于 CMSIS 寄存器定义直接操作，
 * 仅依赖 `stm32g4xx.h`、`stm32g4xx_ll_bus.h`/`ll_gpio.h`/`ll_rcc.h` 做时钟/GPIO。
 *
 * 重要硬件约束（STM32G4 参考手册 RM0440）：
 * - FDCAN Message RAM 布局由硬件固定，每个实例 212 words（848 bytes），不可通过
 *   SIDFC/XIDFC/RXF0C/RXF1C/RXESC/TXESC/TXEFC 寄存器配置（这些寄存器在 G4 上不存在）。
 * - 每个实例固定：28 个标准过滤器、8 个扩展过滤器、RX FIFO0/1 各 3 元素、
 *   TX Event FIFO 3 元素、TX FIFO/Queue 3 元素；RX/TX 元素固定 64 字节。
 * - `bm_can_stm32g4_config_t` 中的 `*_count` 字段仅决定软件实际使用数量，不能超过
 *   上述硬件上限；`message_ram_offset` 决定本实例在全局 10KB Message RAM 中的起始
 *   word 偏移，FDCAN1/FDCAN2 区域不可重叠。
 *
 * 本后端支持：
 * - FDCAN1/FDCAN2 多实例，引脚/AF/IRQ 由 App 配置。
 * - 标准帧与扩展帧硬件过滤器。
 * - RX FIFO0 有界循环处理、FIFO 满/消息丢失检测、TX FIFO 满检测。
 * - Bus-off / error warning / error passive 检测与手动恢复。
 * - 真实接收时间戳（`bm_uptime_us()`）。
 *
 * 应用通过 `bm_can_stm32g4_config_t` 指定 FDCANx/引脚/位时序/IRQ；
 * Bmelod 不固定 FDCAN 编号与产品引脚。
 *
 * @author zeh (china_qzh@163.com)
 * @version 1.1
 * @date 2026-07-28
 *
 * @par 修改日志:
 *
 *    Date         Version        Author          Description
 * 2026-07-28       1.0            zeh            新增 STM32G4 FDCAN 寄存器级后端
 * 2026-07-28       1.1            zeh            使用 message_ram_offset、扩展过滤器、
 *                                                真实时间戳、bus-off 恢复
 */
#include "bm_vendor_can_stm32g4.h"
#include "bm_hal_instances_stm32g4.h"
#include "bm/common/bm_types.h"
#include "bm/common/bm_uptime.h"
#include "drv/bm_drv_can.h"

#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "stm32g4xx.h"
#include "stm32g4xx_ll_bus.h"
#include "stm32g4xx_ll_gpio.h"
#include "stm32g4xx_ll_rcc.h"

/** @brief 最大支持的 FDCAN 实例数。 */
#define BM_CAN_STM32G4_INSTANCE_COUNT 2u

/** @brief STM32G4 全局 FDCAN Message RAM 基址（10KB，2560 words）。 */
#define BM_CAN_STM32G4_MSG_RAM_BASE 0x4000A400u

/** @brief 全局 Message RAM 总容量（words）。 */
#define BM_CAN_STM32G4_MSG_RAM_WORDS 2560u

/* ---------- STM32G4 固定 Message RAM 布局（RM0440 / HAL 一致） ---------- */

#define BM_CAN_G4_FLS_NBR 28u   /**< 标准过滤器最大数。 */
#define BM_CAN_G4_FLE_NBR 8u    /**< 扩展过滤器最大数。 */
#define BM_CAN_G4_RF0_NBR 3u    /**< RX FIFO0 元素最大数。 */
#define BM_CAN_G4_RF1_NBR 3u    /**< RX FIFO1 元素最大数。 */
#define BM_CAN_G4_TEF_NBR 3u    /**< TX Event FIFO 元素最大数。 */
#define BM_CAN_G4_TFQ_NBR 3u    /**< TX FIFO/Queue 元素最大数。 */

#define BM_CAN_G4_FLS_SIZE 1u   /**< words */
#define BM_CAN_G4_FLE_SIZE 2u
#define BM_CAN_G4_RF0_SIZE 18u
#define BM_CAN_G4_RF1_SIZE 18u
#define BM_CAN_G4_TEF_SIZE 2u
#define BM_CAN_G4_TFQ_SIZE 18u

#define BM_CAN_G4_FLSSA 0u
#define BM_CAN_G4_FLESA (BM_CAN_G4_FLSSA + (BM_CAN_G4_FLS_NBR * BM_CAN_G4_FLS_SIZE))
#define BM_CAN_G4_RF0SA (BM_CAN_G4_FLESA + (BM_CAN_G4_FLE_NBR * BM_CAN_G4_FLE_SIZE))
#define BM_CAN_G4_RF1SA (BM_CAN_G4_RF0SA + (BM_CAN_G4_RF0_NBR * BM_CAN_G4_RF0_SIZE))
#define BM_CAN_G4_TEFSA (BM_CAN_G4_RF1SA + (BM_CAN_G4_RF1_NBR * BM_CAN_G4_RF1_SIZE))
#define BM_CAN_G4_TFQSA (BM_CAN_G4_TEFSA + (BM_CAN_G4_TEF_NBR * BM_CAN_G4_TEF_SIZE))
#define BM_CAN_G4_SIZE  (BM_CAN_G4_TFQSA + (BM_CAN_G4_TFQ_NBR * BM_CAN_G4_TFQ_SIZE)) /**< 212 words */

/* ---------- 寄存器位定义（CMSIS 已定义大部分，这里只补充缺失的） ---------- */

/* CCCR */
#ifndef FDCAN_CCCR_INIT
#define FDCAN_CCCR_INIT  (1u << 0u)
#endif
#ifndef FDCAN_CCCR_CCE
#define FDCAN_CCCR_CCE   (1u << 1u)
#endif
#ifndef FDCAN_CCCR_DAR
#define FDCAN_CCCR_DAR   (1u << 6u)
#endif
#ifndef FDCAN_CCCR_FDOE
#define FDCAN_CCCR_FDOE  (1u << 8u)
#endif
#ifndef FDCAN_CCCR_BRSE
#define FDCAN_CCCR_BRSE  (1u << 9u)
#endif

/* NBTP */
#ifndef FDCAN_NBTP_NTSEG2_Pos
#define FDCAN_NBTP_NTSEG2_Pos 0u
#endif
#ifndef FDCAN_NBTP_NTSEG1_Pos
#define FDCAN_NBTP_NTSEG1_Pos 8u
#endif
#ifndef FDCAN_NBTP_NBRP_Pos
#define FDCAN_NBTP_NBRP_Pos   16u
#endif
#ifndef FDCAN_NBTP_NSJW_Pos
#define FDCAN_NBTP_NSJW_Pos   25u
#endif

/* DBTP */
#ifndef FDCAN_DBTP_DSJW_Pos
#define FDCAN_DBTP_DSJW_Pos   0u
#endif
#ifndef FDCAN_DBTP_DTSEG2_Pos
#define FDCAN_DBTP_DTSEG2_Pos 4u
#endif
#ifndef FDCAN_DBTP_DTSEG1_Pos
#define FDCAN_DBTP_DTSEG1_Pos 8u
#endif
#ifndef FDCAN_DBTP_DBRP_Pos
#define FDCAN_DBTP_DBRP_Pos   16u
#endif

/* TXBC */
#ifndef FDCAN_TXBC_TFQS_Pos
#define FDCAN_TXBC_TFQS_Pos 30u
#endif

/* RXGFC */
#ifndef FDCAN_RXGFC_RRFE
#define FDCAN_RXGFC_RRFE (1u << 0u)
#endif
#ifndef FDCAN_RXGFC_RRFS
#define FDCAN_RXGFC_RRFS (1u << 1u)
#endif
#ifndef FDCAN_RXGFC_ANFE_Pos
#define FDCAN_RXGFC_ANFE_Pos 2u
#endif
#ifndef FDCAN_RXGFC_ANFS_Pos
#define FDCAN_RXGFC_ANFS_Pos 4u
#endif
#ifndef FDCAN_RXGFC_LSS_Pos
#define FDCAN_RXGFC_LSS_Pos 16u
#endif
#ifndef FDCAN_RXGFC_LSE_Pos
#define FDCAN_RXGFC_LSE_Pos 24u
#endif

/* IR / IE */
#ifndef FDCAN_IR_RF0N
#define FDCAN_IR_RF0N  (1u << 0u)
#endif
#ifndef FDCAN_IR_RF0F
#define FDCAN_IR_RF0F  (1u << 1u)
#endif
#ifndef FDCAN_IR_RF0L
#define FDCAN_IR_RF0L  (1u << 2u)
#endif
#ifndef FDCAN_IR_TC
#define FDCAN_IR_TC    (1u << 7u)
#endif
#ifndef FDCAN_IR_TEFL
#define FDCAN_IR_TEFL  (1u << 12u)
#endif
#ifndef FDCAN_IR_EW
#define FDCAN_IR_EW    (1u << 13u)
#endif
#ifndef FDCAN_IR_EP
#define FDCAN_IR_EP    (1u << 14u)
#endif
#ifndef FDCAN_IR_BO
#define FDCAN_IR_BO    (1u << 15u)
#endif

/* ILE */
#ifndef FDCAN_ILE_EINT0
#define FDCAN_ILE_EINT0 (1u << 0u)
#endif

/* PSR */
#ifndef FDCAN_PSR_EP
#define FDCAN_PSR_EP (1u << 5u)
#endif
#ifndef FDCAN_PSR_EW
#define FDCAN_PSR_EW (1u << 6u)
#endif
#ifndef FDCAN_PSR_BO
#define FDCAN_PSR_BO (1u << 7u)
#endif

/* Message RAM element masks */
#ifndef FDCAN_ELEMENT_MASK_XTD
#define FDCAN_ELEMENT_MASK_XTD   (1u << 30u)
#endif
#ifndef FDCAN_ELEMENT_MASK_STDID
#define FDCAN_ELEMENT_MASK_STDID (0x7FFu << 18u)
#endif
#ifndef FDCAN_ELEMENT_MASK_EXTID
#define FDCAN_ELEMENT_MASK_EXTID (0x1FFFFFFFu)
#endif
#ifndef FDCAN_ELEMENT_MASK_RTR
#define FDCAN_ELEMENT_MASK_RTR   (1u << 29u)
#endif
#ifndef FDCAN_ELEMENT_MASK_DLC
#define FDCAN_ELEMENT_MASK_DLC   (0xFu << 16u)
#endif
#ifndef FDCAN_ELEMENT_MASK_BRS
#define FDCAN_ELEMENT_MASK_BRS   (1u << 20u)
#endif
#ifndef FDCAN_ELEMENT_MASK_FDF
#define FDCAN_ELEMENT_MASK_FDF   (1u << 21u)
#endif

