Zeh868/Bmelod/portable/vendor/stm32g4/bm_hal_can_stm32g4.c
/* Standard filter element word layout */
#define FDCAN_SFEC_DISABLE    0u
#define FDCAN_SFEC_FIFO0      1u
#define FDCAN_SFEC_FIFO1      2u
#define FDCAN_SFEC_REJECT     3u

#define FDCAN_SFT_RANGE       0u
#define FDCAN_SFT_DUAL        1u
#define FDCAN_SFT_MASK        2u

/* Extended filter element word layout */
#define FDCAN_EFEC_DISABLE    0u
#define FDCAN_EFEC_FIFO0      1u
#define FDCAN_EFEC_FIFO1      2u
#define FDCAN_EFEC_REJECT     3u

#define FDCAN_EFT_RANGE       0u
#define FDCAN_EFT_DUAL        1u
#define FDCAN_EFT_MASK        2u

/* -------------------------------------------------------------------------- */
/*  运行时上下文                                                                */
/* -------------------------------------------------------------------------- */

typedef struct {
    const struct bm_hal_can       *dev;
    const bm_can_stm32g4_config_t *cfg;
    int                            initialized;
    int                            started;
    bm_can_rx_callback_t           rx_cb;
    void                          *rx_user;
    bm_can_event_callback_t        event_cb;
    void                          *event_user;
    bm_can_stats_t                 stats;
    int                            bus_off;
    uint32_t                       tx_put_index;
} bm_can_stm32g4_context_t;

static bm_can_stm32g4_context_t g_can_ctx[BM_CAN_STM32G4_INSTANCE_COUNT];

/* -------------------------------------------------------------------------- */
/*  默认配置                                                                    */
/* -------------------------------------------------------------------------- */

/** @brief 默认 FDCAN1 配置（PB8/PB9，AF9，500k Classic CAN）。 */
static const bm_can_stm32g4_config_t g_can_cfg_1 = {
    .fdcan = FDCAN1,
    .rcc_apb1 = LL_APB1_GRP1_PERIPH_FDCAN,
    .tx_pin = BM_STM32G4_CAN1_TX_PIN,
    .rx_pin = BM_STM32G4_CAN1_RX_PIN,
    .gpio_af = BM_STM32G4_CAN_GPIO_AF,
    .nbtr = BM_STM32G4_CAN_NBTR,
    .dbtr = { .prescaler = 8u, .tseg1 = 7u, .tseg2 = 2u, .sjw = 1u },
    .fd_enabled = 0u,
    .message_ram_offset = BM_STM32G4_CAN1_MSG_RAM_OFFSET,
    .std_filter_count = 8u,
    .ext_filter_count = 0u,
    .rx_fifo0_count = BM_CAN_G4_RF0_NBR,
    .rx_fifo1_count = 0u,
    .tx_fifo_count = BM_CAN_G4_TFQ_NBR,
    .tx_event_fifo_count = 0u,
    .rx_elmt_size = 7u, /* 64 bytes（硬件固定） */
    .tx_elmt_size = 7u,
    .irqn = FDCAN1_IT0_IRQn,
    .irq_priority = BM_STM32G4_CAN_IRQ_PRIORITY,
};

/** @brief 默认 FDCAN2 配置（PB12/PB13，AF9，500k Classic CAN）。 */
static const bm_can_stm32g4_config_t g_can_cfg_2 = {
    .fdcan = FDCAN2,
    .rcc_apb1 = LL_APB1_GRP1_PERIPH_FDCAN,
    .tx_pin = BM_STM32G4_CAN2_TX_PIN,
    .rx_pin = BM_STM32G4_CAN2_RX_PIN,
    .gpio_af = BM_STM32G4_CAN_GPIO_AF,
    .nbtr = BM_STM32G4_CAN_NBTR,
    .dbtr = { .prescaler = 8u, .tseg1 = 7u, .tseg2 = 2u, .sjw = 1u },
    .fd_enabled = 0u,
    .message_ram_offset = BM_STM32G4_CAN2_MSG_RAM_OFFSET,
    .std_filter_count = 8u,
    .ext_filter_count = 0u,
    .rx_fifo0_count = BM_CAN_G4_RF0_NBR,
    .rx_fifo1_count = 0u,
    .tx_fifo_count = BM_CAN_G4_TFQ_NBR,
    .tx_event_fifo_count = 0u,
    .rx_elmt_size = 7u,
    .tx_elmt_size = 7u,
    .irqn = FDCAN2_IT0_IRQn,
    .irq_priority = BM_STM32G4_CAN_IRQ_PRIORITY,
};

/* -------------------------------------------------------------------------- */
/*  DLC 与字节数互转                                                            */
/* -------------------------------------------------------------------------- */

static const uint8_t bm_can_dlc_to_bytes[16] = {
    0u, 1u, 2u, 3u, 4u, 5u, 6u, 7u, 8u,
    12u, 16u, 20u, 24u, 32u, 48u, 64u
};

static uint8_t bm_can_bytes_to_dlc(uint8_t len) {
    if (len <= 8u) {
        return len;
    }
    if (len <= 12u) return 9u;
    if (len <= 16u) return 10u;
    if (len <= 20u) return 11u;
    if (len <= 24u) return 12u;
    if (len <= 32u) return 13u;
    if (len <= 48u) return 14u;
    return 15u;
}

/* -------------------------------------------------------------------------- */
/*  底层辅助                                                                    */
/* -------------------------------------------------------------------------- */

/**
 * @brief 由设备实例获取运行时上下文。
 */
static bm_can_stm32g4_context_t *bm_can_stm32g4_ctx_for(
    const struct bm_hal_can *dev) {
    const bm_can_stm32g4_config_t *cfg;
    bm_can_stm32g4_context_t *free_slot = NULL;
    uint32_t i;

    if (dev == NULL || dev->config == NULL) {
        return NULL;
    }
    cfg = (const bm_can_stm32g4_config_t *)dev->config;
    for (i = 0u; i < BM_CAN_STM32G4_INSTANCE_COUNT; ++i) {
        if (g_can_ctx[i].cfg == cfg) {
            return &g_can_ctx[i];
        }
        if (free_slot == NULL && g_can_ctx[i].cfg == NULL) {
            free_slot = &g_can_ctx[i];
        }
    }
    return free_slot;
}

/**
 * @brief 由 FDCAN 寄存器基址获取上下文。
 */
static bm_can_stm32g4_context_t *bm_can_stm32g4_ctx_for_fdcan(
    FDCAN_GlobalTypeDef *fdcan) {
    uint32_t i;

    for (i = 0u; i < BM_CAN_STM32G4_INSTANCE_COUNT; ++i) {
        if (g_can_ctx[i].cfg != NULL && g_can_ctx[i].cfg->fdcan == fdcan) {
            return &g_can_ctx[i];
        }
    }
    return NULL;
}

/**
 * @brief 计算引脚所在 GPIO 端口与位掩码。
 */
static GPIO_TypeDef *bm_can_stm32g4_port(uint32_t pin_encoding, uint32_t *pin_num) {
    uint32_t port = pin_encoding >> 4u;
    *pin_num = pin_encoding & 0x0Fu;

    switch (port) {
    case 0u: return GPIOA;
    case 1u: return GPIOB;
    case 2u: return GPIOC;
    case 3u: return GPIOD;
    case 4u: return GPIOE;
    case 5u: return GPIOF;
    case 6u: return GPIOG;
    default: return NULL;
    }
}

/**
 * @brief 配置 CAN TX/RX GPIO 复用。
 */
static int bm_can_stm32g4_gpio_init(const bm_can_stm32g4_config_t *cfg) {
    GPIO_TypeDef *tx_port, *rx_port;
    uint32_t tx_pin, rx_pin;
    uint32_t tx_mask, rx_mask;

    tx_port = bm_can_stm32g4_port(cfg->tx_pin, &tx_pin);
    rx_port = bm_can_stm32g4_port(cfg->rx_pin, &rx_pin);
    if (tx_port == NULL || rx_port == NULL) {
        return BM_ERR_INVALID;
    }

    LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOA |
                             LL_AHB2_GRP1_PERIPH_GPIOB |
                             LL_AHB2_GRP1_PERIPH_GPIOC |
                             LL_AHB2_GRP1_PERIPH_GPIOD);

