Zeh868/Bmelod/portable/vendor/stm32g4/bm_hal_can_stm32g4.c
    tx_mask = 1u << tx_pin;
    rx_mask = 1u << rx_pin;

    LL_GPIO_SetPinMode(tx_port, tx_mask, LL_GPIO_MODE_ALTERNATE);
    LL_GPIO_SetPinSpeed(tx_port, tx_mask, LL_GPIO_SPEED_FREQ_HIGH);
    LL_GPIO_SetPinOutputType(tx_port, tx_mask, LL_GPIO_OUTPUT_PUSHPULL);
    LL_GPIO_SetPinPull(tx_port, tx_mask, LL_GPIO_PULL_NO);

    LL_GPIO_SetPinMode(rx_port, rx_mask, LL_GPIO_MODE_ALTERNATE);
    LL_GPIO_SetPinSpeed(rx_port, rx_mask, LL_GPIO_SPEED_FREQ_HIGH);
    LL_GPIO_SetPinPull(rx_port, rx_mask, LL_GPIO_PULL_NO);

    if (tx_pin < 8u) {
        LL_GPIO_SetAFPin_0_7(tx_port, tx_mask, cfg->gpio_af);
    } else {
        LL_GPIO_SetAFPin_8_15(tx_port, tx_mask, cfg->gpio_af);
    }
    if (rx_pin < 8u) {
        LL_GPIO_SetAFPin_0_7(rx_port, rx_mask, cfg->gpio_af);
    } else {
        LL_GPIO_SetAFPin_8_15(rx_port, rx_mask, cfg->gpio_af);
    }

    return BM_OK;
}

/**
 * @brief 等待 CCCR.INIT 达到目标状态，超时返回错误。
 */
static int bm_can_stm32g4_wait_init(FDCAN_GlobalTypeDef *fdcan, uint32_t target) {
    uint32_t timeout = 100000u;

    while (((fdcan->CCCR & FDCAN_CCCR_INIT) != target) && (timeout != 0u)) {
        timeout--;
    }
    return ((fdcan->CCCR & FDCAN_CCCR_INIT) == target) ? BM_OK : BM_ERR_TIMEOUT;
}

/**
 * @brief 获取 Message RAM 中某实例区域的绝对地址。
 *
 * @param cfg     FDCAN 平台配置（含 message_ram_offset）
 * @param offset  实例内 32-bit word 偏移
 */
static volatile uint32_t *bm_can_stm32g4_msg_ram(
    const bm_can_stm32g4_config_t *cfg, uint32_t offset) {
    uint32_t addr = BM_CAN_STM32G4_MSG_RAM_BASE +
                    (cfg->message_ram_offset + offset) * 4u;

    return (volatile uint32_t *)addr;
}

/**
 * @brief 进入 INIT 模式并解锁配置（CCE=1）。
 */
static int bm_can_stm32g4_enter_init(FDCAN_GlobalTypeDef *fdcan) {
    int rc;

    fdcan->CCCR |= FDCAN_CCCR_INIT;
    rc = bm_can_stm32g4_wait_init(fdcan, FDCAN_CCCR_INIT);
    if (rc != BM_OK) {
        return rc;
    }
    fdcan->CCCR |= FDCAN_CCCR_CCE;
    return BM_OK;
}

/**
 * @brief 退出 INIT 模式。
 */
static int bm_can_stm32g4_leave_init(FDCAN_GlobalTypeDef *fdcan) {
    fdcan->CCCR &= ~(FDCAN_CCCR_INIT | FDCAN_CCCR_CCE);
    return bm_can_stm32g4_wait_init(fdcan, 0u);
}

/* -------------------------------------------------------------------------- */
/*  配置校验                                                                    */
/* -------------------------------------------------------------------------- */

/**
 * @brief 校验位时序参数范围。
 */
static int bm_can_stm32g4_validate_timing(const bm_can_stm32g4_bit_timing_t *bt) {
    if (bt->prescaler < 1u || bt->prescaler > 512u ||
        bt->tseg1 < 1u || bt->tseg1 > 256u ||
        bt->tseg2 < 1u || bt->tseg2 > 128u ||
        bt->sjw < 1u || bt->sjw > 128u) {
        return BM_ERR_INVALID;
    }
    return BM_OK;
}

/**
 * @brief 校验整个 FDCAN 配置。
 */
static int bm_can_stm32g4_validate_config(const bm_can_stm32g4_config_t *cfg) {
    if (cfg == NULL) {
        return BM_ERR_INVALID;
    }
    if (cfg->fdcan != FDCAN1 && cfg->fdcan != FDCAN2) {
        return BM_ERR_INVALID;
    }
    if (cfg->gpio_af > 15u) {
        return BM_ERR_INVALID;
    }
    if (bm_can_stm32g4_port(cfg->tx_pin, &(uint32_t){0u}) == NULL ||
        bm_can_stm32g4_port(cfg->rx_pin, &(uint32_t){0u}) == NULL) {
        return BM_ERR_INVALID;
    }
    if (cfg->irqn != FDCAN1_IT0_IRQn && cfg->irqn != FDCAN1_IT1_IRQn &&
        cfg->irqn != FDCAN2_IT0_IRQn && cfg->irqn != FDCAN2_IT1_IRQn) {
        return BM_ERR_INVALID;
    }
    if (bm_can_stm32g4_validate_timing(&cfg->nbtr) != BM_OK) {
        return BM_ERR_INVALID;
    }
    if (cfg->fd_enabled != 0u) {
        if (bm_can_stm32g4_validate_timing(&cfg->dbtr) != BM_OK) {
            return BM_ERR_INVALID;
        }
    }
    if (cfg->std_filter_count > BM_CAN_G4_FLS_NBR ||
        cfg->ext_filter_count > BM_CAN_G4_FLE_NBR ||
        cfg->rx_fifo0_count > BM_CAN_G4_RF0_NBR ||
        cfg->rx_fifo1_count > BM_CAN_G4_RF1_NBR ||
        cfg->tx_fifo_count > BM_CAN_G4_TFQ_NBR ||
        cfg->tx_event_fifo_count > BM_CAN_G4_TEF_NBR) {
        return BM_ERR_INVALID;
    }
    /* G4 硬件固定 64 字节元素；rx_elmt_size/tx_elmt_size 保留字段，只接受 7 */
    if (cfg->rx_elmt_size != 7u || cfg->tx_elmt_size != 7u) {
        return BM_ERR_INVALID;
    }
    if ((cfg->message_ram_offset + BM_CAN_G4_SIZE) > BM_CAN_STM32G4_MSG_RAM_WORDS) {
        return BM_ERR_INVALID;
    }

    return BM_OK;
}

/**
 * @brief 计算并返回实际波特率（bps）与采样点（千分比）。
 */
void bm_can_stm32g4_calc_bitrate(const bm_can_stm32g4_config_t *cfg,
                                 uint32_t *bitrate, uint32_t *sample_pt_promille) {
    LL_RCC_ClocksTypeDef clocks;
    uint32_t pclk;
    uint32_t tq;
    uint32_t sp;

    LL_RCC_GetSystemClocksFreq(&clocks);
    pclk = clocks.PCLK1_Frequency;

    tq = cfg->nbtr.prescaler * (cfg->nbtr.tseg1 + cfg->nbtr.tseg2 + 1u);
    if (tq == 0u) {
        *bitrate = 0u;
        *sample_pt_promille = 0u;
        return;
    }
    *bitrate = pclk / tq;

    sp = ((cfg->nbtr.tseg1 + 1u) * 1000u) /
         (cfg->nbtr.tseg1 + cfg->nbtr.tseg2 + 1u);
    *sample_pt_promille = sp;
}

/* -------------------------------------------------------------------------- */
/*  硬件初始化                                                                  */
/* -------------------------------------------------------------------------- */

static int bm_can_stm32g4_hw_init(bm_can_stm32g4_context_t *ctx) {
    const bm_can_stm32g4_config_t *cfg = ctx->cfg;
    FDCAN_GlobalTypeDef *fdcan = cfg->fdcan;
    uint32_t nbtp, dbtp;
    uint32_t i;
    int rc;

    rc = bm_can_stm32g4_validate_config(cfg);
    if (rc != BM_OK) {
        return rc;
    }

    /* 使能时钟（FDCAN1/FDCAN2 共享 APB1 的 FDCANEN 位） */
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_FDCAN);

    /* 配置 GPIO */
    rc = bm_can_stm32g4_gpio_init(cfg);
    if (rc != BM_OK) {
        return rc;
    }

    /* 进入 INIT + CCE */
    if (bm_can_stm32g4_enter_init(fdcan) != BM_OK) {
        return BM_ERR_TIMEOUT;
    }

    /* 全局配置 */
    fdcan->CCCR = FDCAN_CCCR_INIT | FDCAN_CCCR_CCE | FDCAN_CCCR_DAR;
    if (cfg->fd_enabled != 0u) {
        fdcan->CCCR |= FDCAN_CCCR_FDOE;
    }

    /* 位时序 */
    nbtp = ((cfg->nbtr.tseg2 - 1u) << FDCAN_NBTP_NTSEG2_Pos) |
           ((cfg->nbtr.tseg1 - 1u) << FDCAN_NBTP_NTSEG1_Pos) |
           ((cfg->nbtr.prescaler - 1u) << FDCAN_NBTP_NBRP_Pos) |
           ((cfg->nbtr.sjw - 1u) << FDCAN_NBTP_NSJW_Pos);
    fdcan->NBTP = nbtp;

    if (cfg->fd_enabled != 0u) {
        dbtp = ((cfg->dbtr.tseg2 - 1u) << FDCAN_DBTP_DTSEG2_Pos) |
               ((cfg->dbtr.tseg1 - 1u) << FDCAN_DBTP_DTSEG1_Pos) |
               ((cfg->dbtr.prescaler - 1u) << FDCAN_DBTP_DBRP_Pos) |
               ((cfg->dbtr.sjw - 1u) << FDCAN_DBTP_DSJW_Pos);
        fdcan->DBTP = dbtp;
    }

    /* 清零本实例 Message RAM */
    for (i = 0u; i < BM_CAN_G4_SIZE; ++i) {
        bm_can_stm32g4_msg_ram(cfg, i)[0] = 0u;
    }

    /* 全局过滤器：默认拒绝所有非匹配帧（fail-closed），应用通过 add_filter 开通。
     * STM32G4 无 SIDFC/XIDFC/RXF0C/RXF1C/RXESC/TXESC/TXEFC 寄存器，
     * 过滤器/RX/TX 数量与元素大小由硬件固定，仅通过 RXGFC 的 LSS/LSE 控制实际使用数。 */
    fdcan->RXGFC = FDCAN_RXGFC_RRFE | FDCAN_RXGFC_RRFS |
                   (2u << FDCAN_RXGFC_ANFE_Pos) |
                   (2u << FDCAN_RXGFC_ANFS_Pos) |
                   ((cfg->std_filter_count & 0xFFu) << FDCAN_RXGFC_LSS_Pos) |
                   ((cfg->ext_filter_count & 0xFFu) << FDCAN_RXGFC_LSE_Pos);

    /* TX FIFO 大小（G4 固定 3 个元素；TXBC 只配 FIFO/Queue 模式） */
    fdcan->TXBC = ((cfg->tx_fifo_count & 0x3Fu) << FDCAN_TXBC_TFQS_Pos);

    /* 中断：使能 RX FIFO0 新消息、TX 完成、bus-off、error warning/passive */
    fdcan->IE = FDCAN_IR_RF0N | FDCAN_IR_TC | FDCAN_IR_BO | FDCAN_IR_EW | FDCAN_IR_EP;
    fdcan->ILS = 0u;            /* 所有中断映射到 Line 0 */
    fdcan->ILE = FDCAN_ILE_EINT0;
    fdcan->IR = fdcan->IR;      /* 清所有挂起中断 */

