Zeh868/Bmelod/portable/vendor/stm32g4/bm_hal_can_stm32g4.c
    /* NVIC */
    NVIC_SetPriority(cfg->irqn, cfg->irq_priority);
    NVIC_EnableIRQ(cfg->irqn);

    return BM_OK;
}

/* -------------------------------------------------------------------------- */
/*  反初始化 / 复位                                                               */
/* -------------------------------------------------------------------------- */

static int bm_can_stm32g4_hw_deinit(bm_can_stm32g4_context_t *ctx) {
    const bm_can_stm32g4_config_t *cfg = ctx->cfg;
    FDCAN_GlobalTypeDef *fdcan;

    if (cfg == NULL) {
        return BM_ERR_INVALID;
    }
    fdcan = cfg->fdcan;

    NVIC_DisableIRQ(cfg->irqn);
    if (bm_can_stm32g4_enter_init(fdcan) != BM_OK) {
        return BM_ERR_TIMEOUT;
    }

    fdcan->CCCR = FDCAN_CCCR_INIT | FDCAN_CCCR_CCE;
    fdcan->IE = 0u;
    fdcan->ILE = 0u;
    fdcan->IR = fdcan->IR;

    /* 时钟由 FDCAN1/FDCAN2 共享，这里不关闭，避免影响另一实例 */
    return BM_OK;
}

/* -------------------------------------------------------------------------- */
/*  过滤器配置                                                                  */
/* -------------------------------------------------------------------------- */

static int bm_can_stm32g4_add_std_filter(bm_can_stm32g4_context_t *ctx,
                                         const bm_can_filter_t *filter,
                                         uint32_t *filter_id) {
    const bm_can_stm32g4_config_t *cfg = ctx->cfg;
    FDCAN_GlobalTypeDef *fdcan = cfg->fdcan;
    volatile uint32_t *sf_addr;
    uint32_t sfec;
    uint32_t sft;
    uint32_t word;
    uint32_t idx;
    uint32_t i;

    if (filter->fifo > BM_CAN_FILTER_FIFO1) {
        return BM_ERR_INVALID;
    }
    if (filter->id > BM_CAN_STD_ID_MAX || filter->mask > BM_CAN_STD_ID_MAX) {
        return BM_ERR_INVALID;
    }

    sf_addr = bm_can_stm32g4_msg_ram(cfg, BM_CAN_G4_FLSSA);
    idx = cfg->std_filter_count;
    for (i = 0u; i < cfg->std_filter_count; ++i) {
        /* 检查是否已禁用（SFEC=0） */
        if ((sf_addr[i] & (0x7u << 27u)) == 0u) {
            idx = i;
            break;
        }
    }
    if (idx >= cfg->std_filter_count) {
        return BM_ERR_NO_MEM;
    }

    sfec = (filter->fifo == BM_CAN_FILTER_FIFO0) ? FDCAN_SFEC_FIFO0 : FDCAN_SFEC_FIFO1;

    switch (filter->type) {
    case BM_CAN_FILTER_TYPE_RANGE:
        sft = FDCAN_SFT_RANGE;
        break;
    case BM_CAN_FILTER_TYPE_MASK:
        sft = FDCAN_SFT_MASK;
        break;
    case BM_CAN_FILTER_TYPE_LIST:
        sft = FDCAN_SFT_DUAL;
        break;
    default:
        return BM_ERR_INVALID;
    }

    word = ((sft & 0x3u) << 30u) |
           ((sfec & 0x7u) << 27u) |
           ((filter->id & 0x7FFu) << 16u) |
           (filter->mask & 0x7FFu);

    sf_addr[idx] = word;

    if (filter_id != NULL) {
        *filter_id = idx;
    }

    /* 若目标为 FIFO1，使能 FIFO1 新消息中断 */
    if (filter->fifo == BM_CAN_FILTER_FIFO1) {
        fdcan->IE |= FDCAN_IR_RF1N;
    }

    return BM_OK;
}

static int bm_can_stm32g4_add_ext_filter(bm_can_stm32g4_context_t *ctx,
                                         const bm_can_filter_t *filter,
                                         uint32_t *filter_id) {
    const bm_can_stm32g4_config_t *cfg = ctx->cfg;
    FDCAN_GlobalTypeDef *fdcan = cfg->fdcan;
    volatile uint32_t *ef_addr;
    uint32_t efec;
    uint32_t eft;
    uint32_t word0, word1;
    uint32_t idx;
    uint32_t i;

    if (cfg->ext_filter_count == 0u) {
        return BM_ERR_NOT_SUPPORTED;
    }
    if (filter->fifo > BM_CAN_FILTER_FIFO1) {
        return BM_ERR_INVALID;
    }
    if (filter->id > BM_CAN_EXT_ID_MAX || filter->mask > BM_CAN_EXT_ID_MAX) {
        return BM_ERR_INVALID;
    }

    ef_addr = bm_can_stm32g4_msg_ram(cfg, BM_CAN_G4_FLESA);
    idx = cfg->ext_filter_count;
    for (i = 0u; i < cfg->ext_filter_count; ++i) {
        if ((ef_addr[i * 2u] & (0x7u << 29u)) == 0u) {
            idx = i;
            break;
        }
    }
    if (idx >= cfg->ext_filter_count) {
        return BM_ERR_NO_MEM;
    }

    efec = (filter->fifo == BM_CAN_FILTER_FIFO0) ? FDCAN_EFEC_FIFO0 : FDCAN_EFEC_FIFO1;

    switch (filter->type) {
    case BM_CAN_FILTER_TYPE_RANGE:
        eft = FDCAN_EFT_RANGE;
        break;
    case BM_CAN_FILTER_TYPE_MASK:
        eft = FDCAN_EFT_MASK;
        break;
    case BM_CAN_FILTER_TYPE_LIST:
        eft = FDCAN_EFT_DUAL;
        break;
    default:
        return BM_ERR_INVALID;
    }

    word0 = ((eft & 0x3u) << 30u) |
            ((efec & 0x7u) << 29u) |
            (filter->id & 0x1FFFFFFFu);
    word1 = filter->mask & 0x1FFFFFFFu;

    ef_addr[idx * 2u] = word0;
    ef_addr[idx * 2u + 1u] = word1;

    if (filter_id != NULL) {
        *filter_id = idx + cfg->std_filter_count;
    }

    if (filter->fifo == BM_CAN_FILTER_FIFO1) {
        fdcan->IE |= FDCAN_IR_RF1N;
    }

    return BM_OK;
}

/* -------------------------------------------------------------------------- */
/*  发送                                                                        */
/* -------------------------------------------------------------------------- */

static int bm_can_stm32g4_validate_frame(const bm_can_frame_t *frame,
                                         int fd_allowed) {
    if (frame->dlc > BM_CAN_MAX_DLC) {
        return BM_ERR_INVALID;
    }
    if ((frame->flags & BM_CAN_FLAG_FD) != 0u && !fd_allowed) {
        return BM_ERR_NOT_SUPPORTED;
    }
    if ((frame->flags & BM_CAN_FLAG_FD) == 0u && frame->dlc > 8u) {
        return BM_ERR_INVALID;
    }
    if ((frame->flags & BM_CAN_FLAG_EXT) != 0u) {
        if (frame->id > BM_CAN_EXT_ID_MAX) {
            return BM_ERR_INVALID;
        }
    } else {
        if (frame->id > BM_CAN_STD_ID_MAX) {
            return BM_ERR_INVALID;
        }
    }
    return BM_OK;
}

static int bm_can_stm32g4_send(const struct bm_hal_can *dev,
                               const bm_can_frame_t *frame) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);
    const bm_can_stm32g4_config_t *cfg;
    FDCAN_GlobalTypeDef *fdcan;
    volatile uint32_t *tx_addr;
    uint32_t put_idx;
    uint32_t word0, word1;
    uint32_t dlc_code;
    uint32_t data_words;
    uint32_t status;
    uint32_t i;
    int rc;

    if (ctx == NULL || ctx->cfg == NULL) {
        return BM_ERR_INVALID;
    }
    cfg = ctx->cfg;
    fdcan = cfg->fdcan;

    if (!ctx->initialized) {
        return BM_ERR_NOT_INIT;
    }
    if (!ctx->started) {
        return BM_ERR_INVALID;
    }

