Zeh868/Bmelod/portable/vendor/stm32g4/bm_hal_can_stm32g4.c
    rc = bm_can_stm32g4_validate_frame(frame, cfg->fd_enabled != 0u);
    if (rc != BM_OK) {
        return rc;
    }

    status = fdcan->TXFQS;
    if ((status & FDCAN_TXFQS_TFQF_Msk) != 0u) {
        return BM_ERR_BUSY;
    }
    put_idx = (status >> 16u) & 0x3Fu; /* TFQPI field */

    dlc_code = bm_can_bytes_to_dlc(frame->dlc);
    data_words = (bm_can_dlc_to_bytes[dlc_code] + 3u) / 4u;

    /* Word 0: ID + flags */
    if ((frame->flags & BM_CAN_FLAG_EXT) != 0u) {
        word0 = FDCAN_ELEMENT_MASK_XTD | (frame->id & FDCAN_ELEMENT_MASK_EXTID);
    } else {
        word0 = ((frame->id & 0x7FFu) << 18u);
    }
    if ((frame->flags & BM_CAN_FLAG_RTR) != 0u) {
        word0 |= FDCAN_ELEMENT_MASK_RTR;
    }
    if ((frame->flags & BM_CAN_FLAG_FD) != 0u) {
        word0 |= FDCAN_ELEMENT_MASK_FDF;
    }

    /* Word 1: DLC + marker */
    word1 = ((uint32_t)dlc_code << 16u) | (put_idx & 0xFFu);
    if ((frame->flags & BM_CAN_FLAG_BRS) != 0u) {
        word1 |= FDCAN_ELEMENT_MASK_BRS;
    }

    tx_addr = bm_can_stm32g4_msg_ram(cfg,
                                     BM_CAN_G4_TFQSA +
                                     (put_idx * BM_CAN_G4_TFQ_SIZE));

    tx_addr[0] = word0;
    tx_addr[1] = word1;
    for (i = 0u; i < data_words; ++i) {
        tx_addr[2 + i] = ((uint32_t)frame->data[i * 4 + 0]) |
                         ((uint32_t)frame->data[i * 4 + 1] << 8u) |
                         ((uint32_t)frame->data[i * 4 + 2] << 16u) |
                         ((uint32_t)frame->data[i * 4 + 3] << 24u);
    }

    /* 请求发送 */
    fdcan->TXBAR = ((uint32_t)1u << put_idx);
    ctx->tx_put_index = put_idx;
    ctx->stats.tx_count++;

    return BM_OK;
}

/* -------------------------------------------------------------------------- */
/*  ISR 处理                                                                    */
/* -------------------------------------------------------------------------- */

/**
 * @brief 从 RX FIFO0 读取一帧。
 */
static void bm_can_stm32g4_rx_fifo0_read(bm_can_stm32g4_context_t *ctx) {
    const bm_can_stm32g4_config_t *cfg = ctx->cfg;
    FDCAN_GlobalTypeDef *fdcan = cfg->fdcan;
    volatile uint32_t *rx_addr;
    bm_can_frame_t frame;
    uint32_t get_idx;
    uint32_t word0, word1;
    uint32_t dlc_code;
    uint32_t data_words;
    uint32_t i;

    if ((fdcan->RXF0S & 0x7Fu) == 0u) {
        return;
    }

    get_idx = (fdcan->RXF0S >> 8u) & 0x3Fu; /* F0GI field */

    rx_addr = bm_can_stm32g4_msg_ram(cfg,
                                     BM_CAN_G4_RF0SA +
                                     (get_idx * BM_CAN_G4_RF0_SIZE));

    word0 = rx_addr[0];
    word1 = rx_addr[1];

    (void)memset(&frame, 0, sizeof(frame));

    if ((word0 & FDCAN_ELEMENT_MASK_XTD) != 0u) {
        frame.flags |= BM_CAN_FLAG_EXT;
        frame.id = word0 & FDCAN_ELEMENT_MASK_EXTID;
    } else {
        frame.id = (word0 >> 18u) & 0x7FFu;
    }
    if ((word0 & FDCAN_ELEMENT_MASK_RTR) != 0u) {
        frame.flags |= BM_CAN_FLAG_RTR;
    }
    if ((word1 & FDCAN_ELEMENT_MASK_FDF) != 0u) {
        frame.flags |= BM_CAN_FLAG_FD;
    }
    if ((word1 & FDCAN_ELEMENT_MASK_BRS) != 0u) {
        frame.flags |= BM_CAN_FLAG_BRS;
    }

    dlc_code = (word1 >> 16u) & 0xFu;
    frame.dlc = bm_can_dlc_to_bytes[dlc_code];

    data_words = (frame.dlc + 3u) / 4u;
    for (i = 0u; i < data_words; ++i) {
        uint32_t dw = rx_addr[2 + i];
        frame.data[i * 4 + 0] = (uint8_t)(dw);
        frame.data[i * 4 + 1] = (uint8_t)(dw >> 8u);
        frame.data[i * 4 + 2] = (uint8_t)(dw >> 16u);
        frame.data[i * 4 + 3] = (uint8_t)(dw >> 24u);
    }

    /* 真实时间戳 */
    frame.timestamp_us = bm_uptime_us();

    /* 确认读取 */
    fdcan->RXF0A = get_idx;

    ctx->stats.rx_count++;
    if (ctx->rx_cb != NULL) {
        ctx->rx_cb(ctx->dev, &frame, ctx->rx_user);
    }
}

/**
 * @brief RX FIFO0 ISR：有界循环读取所有待处理帧。
 */
static void bm_can_stm32g4_rx_fifo0_isr(bm_can_stm32g4_context_t *ctx) {
    FDCAN_GlobalTypeDef *fdcan = ctx->cfg->fdcan;
    uint32_t iter = 0u;

    while (((fdcan->RXF0S & 0x7Fu) != 0u) && (iter < 8u)) {
        bm_can_stm32g4_rx_fifo0_read(ctx);
        iter++;
    }
}

/**
 * @brief 更新错误与协议状态统计。
 */
static void bm_can_stm32g4_update_protocol_status(bm_can_stm32g4_context_t *ctx) {
    FDCAN_GlobalTypeDef *fdcan = ctx->cfg->fdcan;
    uint32_t psr = fdcan->PSR;
    uint32_t events = 0u;

    if ((psr & FDCAN_PSR_BO) != 0u && ctx->bus_off == 0) {
        ctx->bus_off = 1;
        ctx->stats.bus_off_count++;
        events |= BM_CAN_EVT_BUS_OFF;
    }
    if ((psr & FDCAN_PSR_EW) != 0u) {
        ctx->stats.error_warning_count++;
        events |= BM_CAN_EVT_ERROR_WARNING;
    }
    if ((psr & FDCAN_PSR_EP) != 0u) {
        ctx->stats.error_passive_count++;
        events |= BM_CAN_EVT_ERROR_PASSIVE;
    }
    if (ctx->bus_off != 0 && (psr & FDCAN_PSR_BO) == 0u) {
        ctx->bus_off = 0;
        events |= BM_CAN_EVT_BUS_OFF_RECOVER;
    }

    ctx->stats.last_errors |= events;
    if (events != 0u && ctx->event_cb != NULL) {
        ctx->event_cb(ctx->dev, events, ctx->event_user);
    }
}

/**
 * @brief 公共 ISR。
 */
static void bm_can_stm32g4_isr(FDCAN_GlobalTypeDef *fdcan) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for_fdcan(fdcan);
    uint32_t ir;

    if (ctx == NULL) {
        return;
    }

    ir = fdcan->IR;

    if ((ir & FDCAN_IR_RF0N) != 0u) {
        fdcan->IR = FDCAN_IR_RF0N;
        bm_can_stm32g4_rx_fifo0_isr(ctx);
    }
    if ((ir & (FDCAN_IR_RF0F | FDCAN_IR_RF0L)) != 0u) {
        fdcan->IR = (ir & (FDCAN_IR_RF0F | FDCAN_IR_RF0L));
        if ((ir & FDCAN_IR_RF0F) != 0u) {
            ctx->stats.rx_overflow_count++;
            ctx->stats.last_errors |= BM_CAN_EVT_RX_OVERFLOW;
            if (ctx->event_cb != NULL) {
                ctx->event_cb(ctx->dev, BM_CAN_EVT_RX_OVERFLOW, ctx->event_user);
            }
        }
        if ((ir & FDCAN_IR_RF0L) != 0u) {
            ctx->stats.rx_overflow_count++;
            ctx->stats.last_errors |= BM_CAN_EVT_RX_OVERFLOW;
            if (ctx->event_cb != NULL) {
                ctx->event_cb(ctx->dev, BM_CAN_EVT_RX_OVERFLOW, ctx->event_user);
            }
        }
    }
    if ((ir & FDCAN_IR_TC) != 0u) {
        fdcan->IR = FDCAN_IR_TC;
        if (ctx->event_cb != NULL) {
            ctx->event_cb(ctx->dev, BM_CAN_EVT_TX_COMPLETE, ctx->event_user);
        }
    }
    if ((ir & FDCAN_IR_TEFL) != 0u) {
        fdcan->IR = FDCAN_IR_TEFL;
        ctx->stats.tx_timeout_count++;
        ctx->stats.last_errors |= BM_CAN_EVT_TX_TIMEOUT;
        if (ctx->event_cb != NULL) {
            ctx->event_cb(ctx->dev, BM_CAN_EVT_TX_TIMEOUT, ctx->event_user);
        }
    }
    if ((ir & (FDCAN_IR_BO | FDCAN_IR_EW | FDCAN_IR_EP)) != 0u) {
        fdcan->IR = (ir & (FDCAN_IR_BO | FDCAN_IR_EW | FDCAN_IR_EP));
        bm_can_stm32g4_update_protocol_status(ctx);
    }
}

