Zeh868/Bmelod/portable/vendor/stm32g4/bm_hal_can_stm32g4.c
/* -------------------------------------------------------------------------- */
/*  IRQ handlers                                                                */
/* -------------------------------------------------------------------------- */

void FDCAN1_IT0_IRQHandler(void) {
    bm_can_stm32g4_isr(FDCAN1);
}

void FDCAN2_IT0_IRQHandler(void) {
    bm_can_stm32g4_isr(FDCAN2);
}

/* -------------------------------------------------------------------------- */
/*  HAL API 实现                                                                */
/* -------------------------------------------------------------------------- */

static int bm_can_stm32g4_init(const struct bm_hal_can *dev, void *config) {
    bm_can_stm32g4_context_t *ctx;
    const bm_can_stm32g4_config_t *cfg;
    int rc;

    if (dev == NULL) {
        return BM_ERR_INVALID;
    }
    ctx = bm_can_stm32g4_ctx_for(dev);
    if (ctx == NULL) {
        return BM_ERR_INVALID;
    }

    /* App 可通过 config 参数覆盖 dev->config；NULL 则使用设备默认值 */
    cfg = (config != NULL)
              ? (const bm_can_stm32g4_config_t *)config
              : (const bm_can_stm32g4_config_t *)dev->config;
    if (cfg == NULL) {
        return BM_ERR_INVALID;
    }

    /* 先清零再初始化；硬件初始化失败时不置 initialized */
    ctx->dev = dev;
    ctx->cfg = cfg;
    ctx->initialized = 0;
    ctx->started = 0;
    ctx->bus_off = 0;
    ctx->tx_put_index = 0u;
    ctx->rx_cb = NULL;
    ctx->rx_user = NULL;
    ctx->event_cb = NULL;
    ctx->event_user = NULL;
    (void)memset(&ctx->stats, 0, sizeof(ctx->stats));

    rc = bm_can_stm32g4_hw_init(ctx);
    if (rc != BM_OK) {
        /* 回滚已配置的 GPIO/时钟/中断 */
        (void)bm_can_stm32g4_hw_deinit(ctx);
        ctx->cfg = NULL;
        return rc;
    }

    ctx->initialized = 1;
    return BM_OK;
}

static int bm_can_stm32g4_start(const struct bm_hal_can *dev) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);
    FDCAN_GlobalTypeDef *fdcan;

    if (ctx == NULL || ctx->cfg == NULL) {
        return BM_ERR_INVALID;
    }
    if (!ctx->initialized) {
        return BM_ERR_NOT_INIT;
    }
    fdcan = ctx->cfg->fdcan;
    if (bm_can_stm32g4_leave_init(fdcan) != BM_OK) {
        return BM_ERR_TIMEOUT;
    }
    ctx->started = 1;
    return BM_OK;
}

static int bm_can_stm32g4_stop(const struct bm_hal_can *dev) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);
    FDCAN_GlobalTypeDef *fdcan;

    if (ctx == NULL || ctx->cfg == NULL) {
        return BM_ERR_INVALID;
    }
    if (!ctx->initialized) {
        return BM_ERR_NOT_INIT;
    }
    fdcan = ctx->cfg->fdcan;
    if (bm_can_stm32g4_enter_init(fdcan) != BM_OK) {
        return BM_ERR_TIMEOUT;
    }
    ctx->started = 0;
    return BM_OK;
}

static int bm_can_stm32g4_add_filter(const struct bm_hal_can *dev,
                                     const bm_can_filter_t *filter,
                                     uint32_t *filter_id) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);

    if (ctx == NULL || ctx->cfg == NULL) {
        return BM_ERR_INVALID;
    }
    if (!ctx->initialized) {
        return BM_ERR_NOT_INIT;
    }
    if (filter == NULL) {
        return BM_ERR_INVALID;
    }
    if (filter->id_format == BM_CAN_FILTER_STD) {
        return bm_can_stm32g4_add_std_filter(ctx, filter, filter_id);
    }
    if (filter->id_format == BM_CAN_FILTER_EXT) {
        return bm_can_stm32g4_add_ext_filter(ctx, filter, filter_id);
    }
    return BM_ERR_INVALID;
}

static int bm_can_stm32g4_remove_filter(const struct bm_hal_can *dev,
                                        uint32_t filter_id) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);
    const bm_can_stm32g4_config_t *cfg;
    volatile uint32_t *sf_addr;
    volatile uint32_t *ef_addr;

    if (ctx == NULL || ctx->cfg == NULL) {
        return BM_ERR_INVALID;
    }
    if (!ctx->initialized) {
        return BM_ERR_NOT_INIT;
    }
    cfg = ctx->cfg;

    if (filter_id < cfg->std_filter_count) {
        sf_addr = bm_can_stm32g4_msg_ram(cfg, BM_CAN_G4_FLSSA);
        sf_addr[filter_id] = 0u; /* SFEC=0 禁用 */
        return BM_OK;
    }
    filter_id -= cfg->std_filter_count;
    if (filter_id < cfg->ext_filter_count) {
        ef_addr = bm_can_stm32g4_msg_ram(cfg, BM_CAN_G4_FLESA);
        ef_addr[filter_id * 2u] = 0u; /* EFEC=0 禁用 */
        return BM_OK;
    }
    return BM_ERR_INVALID;
}

static uint32_t bm_can_stm32g4_get_capabilities(const struct bm_hal_can *dev) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);
    uint32_t caps;

    if (ctx == NULL || ctx->cfg == NULL) {
        return 0u;
    }
    caps = BM_CAN_CAP_STD_FILTER | BM_CAN_CAP_FIFO0 | BM_CAN_CAP_TX_FIFO;
    if (ctx->cfg->ext_filter_count > 0u) {
        caps |= BM_CAN_CAP_EXT_FILTER;
    }
    if (ctx->cfg->rx_fifo1_count > 0u) {
        caps |= BM_CAN_CAP_FIFO1;
    }
    if (ctx->cfg->fd_enabled != 0u) {
        caps |= BM_CAN_CAP_FD;
    }
    return caps;
}

static int bm_can_stm32g4_get_stats(const struct bm_hal_can *dev,
                                    bm_can_stats_t *stats) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);

    if (ctx == NULL || ctx->cfg == NULL || stats == NULL) {
        return BM_ERR_INVALID;
    }
    *stats = ctx->stats;
    ctx->stats.last_errors = 0u;
    return BM_OK;
}

static int bm_can_stm32g4_set_rx_callback(const struct bm_hal_can *dev,
                                          bm_can_rx_callback_t cb, void *user) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);

    if (ctx == NULL || ctx->cfg == NULL) {
        return BM_ERR_INVALID;
    }
    ctx->rx_cb = cb;
    ctx->rx_user = user;
    return BM_OK;
}

static int bm_can_stm32g4_set_event_callback(const struct bm_hal_can *dev,
                                             bm_can_event_callback_t cb,
                                             void *user) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);

    if (ctx == NULL || ctx->cfg == NULL) {
        return BM_ERR_INVALID;
    }
    ctx->event_cb = cb;
    ctx->event_user = user;
    return BM_OK;
}

