Zeh868/Bmelod/portable/vendor/stm32g4/bm_hal_can_stm32g4.c
/* -------------------------------------------------------------------------- */
/*  Vendor 特定 API                                                             */
/* -------------------------------------------------------------------------- */

int bm_can_stm32g4_recover(const struct bm_hal_can *dev) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);
    FDCAN_GlobalTypeDef *fdcan;

    if (ctx == NULL || ctx->cfg == NULL) {
        return BM_ERR_INVALID;
    }
    if (!ctx->initialized) {
        return BM_ERR_NOT_INIT;
    }
    fdcan = ctx->cfg->fdcan;

    if (bm_can_stm32g4_enter_init(fdcan) != BM_OK) {
        return BM_ERR_TIMEOUT;
    }
    fdcan->IR = FDCAN_IR_BO;
    if (bm_can_stm32g4_leave_init(fdcan) != BM_OK) {
        return BM_ERR_TIMEOUT;
    }
    ctx->bus_off = 0;
    return BM_OK;
}

int bm_can_stm32g4_get_bitrate(const struct bm_hal_can *dev,
                               uint32_t *bitrate_bps,
                               uint32_t *sample_pt_promille) {
    bm_can_stm32g4_context_t *ctx = bm_can_stm32g4_ctx_for(dev);
    uint32_t bitrate;
    uint32_t sample_pt;

    if (ctx == NULL || ctx->cfg == NULL) {
        return BM_ERR_INVALID;
    }

    bm_can_stm32g4_calc_bitrate(ctx->cfg, &bitrate, &sample_pt);

    if (bitrate_bps != NULL) {
        *bitrate_bps = bitrate;
    }
    if (sample_pt_promille != NULL) {
        *sample_pt_promille = sample_pt;
    }
    return BM_OK;
}

/* -------------------------------------------------------------------------- */
/*  驱动 API 表与默认实例                                                       */
/* -------------------------------------------------------------------------- */

static const struct bm_can_driver_api g_stm32g4_can_api = {
    bm_can_stm32g4_init,
    bm_can_stm32g4_start,
    bm_can_stm32g4_stop,
    bm_can_stm32g4_send,
    bm_can_stm32g4_add_filter,
    bm_can_stm32g4_remove_filter,
    bm_can_stm32g4_get_capabilities,
    bm_can_stm32g4_get_stats,
    bm_can_stm32g4_set_rx_callback,
    bm_can_stm32g4_set_event_callback,
};

const struct bm_hal_can bm_stm32g4_can1 = { &g_stm32g4_can_api, &g_can_cfg_1 };
const struct bm_hal_can bm_stm32g4_can2 = { &g_stm32g4_can_api, &g_can_cfg_2 };
